{"data":[{"id":564186896,"type":"answer","answer_type":"normal","question":{"type":"question","id":307595822,"title":"高中生对哥德巴赫猜想的证明有哪些错误？","question_type":"normal","created":1546272354,"updated_time":1546301579,"url":"https://www.zhihu.com/api/v4/questions/307595822","relationship":{}},"author":{"id":"91e4ec5be5711c08decbd037d212b7e9","url_token":"lu-ya-95-33","name":"陆大牙","avatar_url":"https://pic3.zhimg.com/32e4654f81f7fd9a76b8bf2f748282e9_is.jpg","avatar_url_template":"https://pic3.zhimg.com/32e4654f81f7fd9a76b8bf2f748282e9_{size}.jpg","is_org":false,"type":"people","url":"https://www.zhihu.com/api/v4/people/91e4ec5be5711c08decbd037d212b7e9","user_type":"people","headline":"如果哪天你发现应该早就请我吃饭，那就对了","badge":[],"gender":1,"is_advertiser":false,"follower_count":2,"is_followed":false,"is_privacy":false},"url":"https://www.zhihu.com/api/v4/answers/564186896","thumbnail":"","is_collapsed":false,"created_time":1546339651,"updated_time":1546339651,"extras":"","is_copyable":true,"is_normal":true,"voteup_count":5,"comment_count":2,"is_sticky":false,"admin_closed_comment":false,"comment_permission":"all","can_comment":{"reason":"","status":true},"reshipment_settings":"allowed","content":"\u003cp\u003e最近高中生说证明了哥德巴赫猜想，闹了个笑话，我想起了我十几年前也是高中的时候证明了时间是什么，贴出来博大家一笑。\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e正文\u003c/b\u003e\u003cbr\u003e\u003cb\u003e时间以及其他(草)\u003c/b\u003e\u003c/p\u003e\u003cp\u003e宏观的时间由微观的运动决定\u003cbr\u003e2007年7月7日20:00:36\u003cbr\u003e要以我自己的观点说明时间是什么，就要先建立一些我自己的体系，就如同样的2进制和10进制都能进行计算一样，虽然他们是不同的体系，过程不一样，但结论依然正确。我就要建立一些正确的体系来表达我自己的观点。\u003cbr\u003e宇宙体系1法则体系\u003cbr\u003e我将宇宙的运作和存在的其中的特点具体划分为宇宙法则这样的存在，单说宇宙法则很好理解，但我所说的宇宙法则与人们认为的宇宙法则是有些区别的，平常的宇宙法则是指规则，即宇宙中万事万物运作的规律，我说的宇宙法则则是一种存在。\u003cbr\u003e我认为存在即法则，即将时间（在不确定时间是什么前依然按人们的理解称时间），空间，能量，物质等这些都称为法则，也就是存在。宇宙万物于是便是一个大的法则。\u003cbr\u003e然后划分这些法则为大宇宙法则与小宇宙法则。大宇宙法则是基本法则，小宇宙法则是大宇宙法则的具体化和延伸（包括复合）。比如称空间为大宇宙法则，即基本存在，物质也为大宇宙法则，而达尔文的进化论可以称小宇宙法则（在一定的时期具有正确性的规律总结），将进化论延伸称变化论即物质是一直在不停运动这样的论点也可以称小宇宙法则。\u003cbr\u003e另外还有一种法则关系的划分，既平等法则和前提法则，比如我们认为一种存在的有无不影响到另外的一种存在时候并且他们是同样等级的法则的时候可以称为是平等法则，比如如果我们认为引力法则和质能转换法则可以分别存在并且是同样的小宇宙法则，那么他们间的关系是平等法则，而如果一个法则的存在必须以另外的法则做为前提的话，不论他们之间是否是等阶的法则，那么他们之间的关系就是前提法则。\u003cbr\u003e时间是什么，很多人都考虑过，研究过，观点到现在也并不多，但我没有遇到过具体的说法来说服我时间的含义。霍金的时间简史也不过是对前人的观点修修补补，刚开始我也考虑过是间线的问题，把时间作为单独的对象来研究，但我得不到确切的能自圆其说的解释，即使是能够以这样的传统观点研究下去，但可能我的一生到终结都不会得到一个结论，那么我就需要一个最不可能的解释来做切入点。\u003cbr\u003e我需要很多分析\u003cbr\u003e首先我对人类自身做了一些分析，人类的大脑，以及思想。我认为人的思想是世界上最没有想象力的东西，任何人的思维仿佛都受到了限制，即人的想象力不论多高，都逃不出个人的生活的阅历和知识结构，人类永远也无法想象出超过自身所知的东西。比如在想象其他智慧生命这一项上，我们也可以称其为外星人，人们往往把他们想象成类似于人的存在或者具有人的一些特点，假如一种外星生物具有的人类特点比较少，就很可能的被形容成没有智慧或者凶恶的生物，例如异形，这一点也许是深受美国科幻大片的荼毒。但我依据例外论，即复杂的事物无论其运作规律如何，总有其表面超出其规律的存在。这个例外论先搁置。那么我将人作为复杂的事物，人的思维方式作为规律，即人不能思考超出已知的知识中的东西。具体的意思就是人假如完全不知道某东西的话，完全代表这这个东西无从考证，无法以常规方式推理即无法以现有知识推出，即使推出也无法证明，如果是这样，人就无法超出固有思维去思考此样事务。但因为例外论的存在，我们其中有一些这样的人在不知不觉的情况下可能就接近了真理，即即使这些东西是超出固有知识结构的东西，我们依然可以依靠极端猜想来想象。虽然这样的几率几乎千年不遇。\u003cbr\u003e有趣的是这使我想起了一个定理，无论多么不可能的事情，只要有其发生的几率那么它就一定会发生，并且造成最大最坏的结果。\u003cbr\u003e同样来拿外星人来说，几乎人们都认定了外星人的外在形态以及生命的存在环境，其实还是有人跳出这个限制来思考其他的生命形态的生存状态。我所知的有一种智慧生命的观点是智慧生命完全可以不依靠水，氧，甚至化合方式来保存自身的存在，这样的生命直接存在于宇宙空间中，以一种等离子能量的雾状形态存在，并以这样的形态思考交流。它们只要能保持能量，几乎可以无限的存在下去，虽然不知道这样长的时间用来思考什么才算有意义，但我觉的这样的存在也拥有其存在的几率。\u003cbr\u003e这样分析下去，我对自身的思维产生了怀疑，因为虽然我的知识结构自认为还比较丰富，但对于思考时间这样的不着边的东西来说，相当于与自己跟自己想不开，因为这是超出我自身知识结构的东西，即使我知道一点其他人的观点，甚至是学术界普遍认可的观点，我依然知识贫乏。但既然我认识到了自己的这样，那么就只好用一种笨的方法来破解我的疑问，我新想出了个名词，我把它叫做大是大非论，并且希望这样的方法能使我人为的冲破固有思维规律，并且取得阶段性的突破。甚至一标中的。\u003cbr\u003e大是大非就是把我现在知道的观点看作大是，既然这是我的知识结构，那么要超出这样的知识结构就完全的否定（记住是完全的）原先的观点，然后想尽一切方法不遗余力的去证明否定后的观点是正确的，然后在这个过程中找到突破点。这就是大非。\u003c/p\u003e\u003cp\u003e那么接下来就简单了，否定传统观点，那么时间说现在不成立了，但是我依然得不到一个确切的命题出来，我需要确切的命题才能进行下一步，这难不倒我，既然是完全否定，那么我干脆否定时间好了，这样的的命题就出来了，本世纪最伟大的发现也就出来了：\u003cbr\u003e时间并不存在\u003cbr\u003e这个看起来荒谬的命题就是我接下来的观点了，并且我将不遗余力的证明，时间并不存在！\u003cbr\u003e。\u003cbr\u003e证明：时间并不存在\u003c/p\u003e\u003cp\u003e好了现在用到开始的一些设定，即大宇宙法则，我将一些东西归入了大宇宙法则，至于宇宙是个什么，现在不去管他。大宇宙法则中去除了时间还剩下空间，物质，能量，一切组成无外乎由能量和物质组成，而这一切存在于空间中。如果非要仔细考究的话，甚至可以去掉物质这样的法则，因为质能转换的存在使质能的界限太模糊。即使是去掉物质，那么光说一样东西是由能量组成也无不可。想到这里我又有一个关于物质的有趣想法，我在想能量是一种什么样的存在，以及物质是否是能量的极度压缩。那么物质的极度压缩又是什么，黑洞？黑洞是怎样的物质存在甚至它是否还是物质。这个，太难推论，先不去想它。那么一样事物的存在关系到了能量，空间，但是没有了时间的话，那么一切即使是存在也不会像现在的宇宙这样多姿多彩了，因为没有了时间就没有了变化，那么现在我还怎么打字呢？恩，我的观点是正确的，那么就是说还有什么我没有注意到，即使时间不存在，也不影响事物的变化，那是什么呢。答案很简单，就是变化本身。我不是开玩笑，也不是搞什么诡辩，就是变化本身。如果你笨到现在还不知道的话那么我可以换个说法，是什么使我们的宇宙如此的丰富多彩。\u003cbr\u003e是速度。\u003cbr\u003e是我们一直忽略的，一直把它不当回事的，速度。为什么是速度？因为人们所知道的速度全部是速度的表象，即相对速度。\u003cbr\u003e我来做个论证，速度是客观的存在(既法则)，这点没有人怀疑，因为从小到基本粒子，大到整个宇宙，都存在速度，速度无处不在啊，实在是个变态的存在，之所以我们以为时间是时间，其实都是速度的假象啊。整个宇宙都在以一种速度在膨胀，假如宇宙大爆炸论有点道理的话，整个银河系都在以一种速度在旋转，假如射电天文望远镜没坏的话，整个太阳系都在旋转，地球也在旋转，然后一直小小小到基本粒子，都在运动着，并不是因为有时间才运动而是有运动我们才感觉到所谓的时间啊！假如还有谁不相信的话，那么简单的举一个例子：如果一个人的全部构成，包括全身的基本粒子，都停止运动，那么可以说，对于那个人来说，时间停止了！扩大到宇宙，如果形成宇宙的所有物质都停止运动，那么这个宇宙的时间也就停止了！这就是为什么时间是相对的，因为速度是相对的。\u003cbr\u003e这样的结论已经很不错了，但对于我来说，倘若仅推论至此恰恰证明了思维的界限论，假如满足这样的结果，我也不必那么大费周章了，我要做的还很多。\u003cbr\u003e要证明的东西还很多，但这之前有个问题，速度是什么。跟问时间是什么一样，如果回答不了这个问题跟胡乱凑个推论没什么区别。速度是什么呢？物质又是什么，空间又是什么。很搞笑，因为速度是大宇宙法则，甚至我还给他起了个新的名字叫范宇宙法则，但速度究竟是什么跟问空间是什么一样是件很令人头疼的事情。以宇宙大爆炸观点来说，宇宙爆炸，那么一霎那间，同时诞生了物质能量，空间，和速度。一个疑问，宇宙之外是什么，没有空间，没有能量，没有速度，虽然有点不负责任，但我还是给宇宙之外的存在起了个名字，叫虚。回到宇宙大爆炸来看吧，那一刻，无数的物质能量产生，以光速争先恐后的飞出，疑问来了，2个疑问，我们都知道鞭炮爆炸的时候会在爆炸中心产生低压，那么宇宙爆炸的时候会在中心产生什么，虚的低压状态？还有，是什么使宇宙从最初那么高的速度中降下来的？这就是奇怪的宇宙爆炸到底产生什么的疑问。必须全部找到那一刻所产生的东西，才能完全的解释宇宙起源。哦对，霍金的《果壳中的宇宙》形象的说宇宙就是个壳，改天要好好分析下。\u003c/p\u003e\u003cp\u003e不过值得庆幸的是我现在没有必要去解释宇宙起源，所以我也不需要发现那一刻的爆炸产生所有的东西是什么，我只要解释速度的来历以及速度的形成以及特点就可以，那么我完全可以用现有的法则来推论。那一刻产生了物质，以及能量以及空间，大家以光速向外飞去（建议忘掉时间这个以及不存在的东西），由于一些能量挤压碰撞，中心的物质比重形成比外围要大，于是就产生了引力效应，这里把引力也归为法则，先不划分等级（也许引力不过是速度的特性罢了那么就可以说成速度效应了），内部对外部产生了引力，于是外部的速度就降了下来，但可惜的是即使大家互相吸引，还是不能相聚，因为宇宙爆炸所产生的速度实在太大，以至于虽然最里的物质能量即使向外的速度量比较少但还是身不由己的向外飞。（速度量是指一个宏观状态的范围速度，宇宙爆炸的那一霎那外围宇宙和内围宇宙的速度量是不同的，因为如果相同，就会产生悖论，即如果相同，那么当时的所有基本粒子按相同速度方向运动，就不会出现现在丰富多彩的宇宙了。）这样互相拉扯的情况下，当然也不排除其他的情况，至少我没有考虑到虚的状态，假如虚是一团稀粥的话那就更好了，这样的情况下宇宙的爆发速度于是缓慢降低，当然这只是指宏观的降低，具体的能量和基本粒子的速度情况谁也不知道，而且这个降低的量非常少，直到持续百亿年，才形成了现如今的宇宙速度，并且在这个过程里，像教科书上的那样，形成了现在的宇宙。\u003cbr\u003e可以说，现在的速度就是宇宙当初那一次性赋予的状态，并且我们只能看到相对速度的改变，而无法观察到速度量的改变，因为我们自身就在速度之中，倘若宏观的速度量改变，就是相对的，所有的基本粒子降低了速度，那么我们也感觉不到，完全感觉不到是不是原来需要想1分钟的事情而现在需要花2分钟。因为我们的思维的速度都随速度而改变了，所以即使速度变的一亿年才相当于现在一秒的速度运作状态，我们依然不知道，我们还当那是一秒。这样的话我们可以证明一个终极论点，就是变化论。（终极论点有2个一个是变化论另一个是例外论，说句笑话，我们的宇宙就是个大例外）因为我们用普通方法证明不了时间本身的变化即速度本身的变化，只能证明相对时间即相对速度的变化，但因为宇宙的形成过程而决定的，必然是速度的变化，所有我们永远都只能从理论上推导速度是在变化的，但无法用事实证明它。即证明我们的标尺是否是一成不变的。除非我们能跳出宇宙。\u003cbr\u003e相对论分广义相对论以及狭义相对论，广义相对论概述的是时间的相对性，并且有关的实验是：在一个飞机上放置原子钟，不间断飞行24小时然后将其与地面的原子钟进行比较2个相同的钟产生了时间的差距，虽然差距微小到可以忽略的地步。通俗的例子是火车上的人虽然不感觉火车在行进但火车下的人却能看到火车在行进。意即以不同的角度来观察万事万物的相对性。并由此得出一件物品的运动速度无限接近于光速时其本身的时间会趋向停止。通俗例子是一个航天员乘坐飞行器以接近光速的速度进行旅行，当1年后返回地球时，可能地球上已经度过了100年。其实在我的眼中，广义相对论更多的是概述了速度本身的特性，但因为速度如何产生类似均衡时间的效果很难解释，所以引进时间这个词来涵盖这一解释过程。\u003cbr\u003e事实上很容易解释，因为速度是有上限的，万事万物的速度上限就是光速，光速的速度是每秒30万公里，为什么我们认为在我们的视线中时间是大致均衡的，就是北京的1秒和纽约的1秒都是1秒，因为我们视线中事物的速度相对于光速来说太低，不足以在视线的2个不同的位置产生相对的时间差距。即地球的速度恒定，人走路的速度恒定，太阳系的速度恒定，银河系的速度恒定。宇宙膨胀的速度恒定，这样虽然一个人走路和一个人座车因为速度的不同而导致的时间不同，但我们已经无法观察到，并且我们本身已经局限于各种速度之间，所以我们认为地球上的时间是大致均衡的。\u003cbr\u003e如果非要观察其差距，选择的实验比如上面的用原子钟在2个速度差距明显的2个状态下观察，我们还是可以观察到所谓的时间差距，事实上我们得出的数据只不过是速度和光速之间一系列的关系而已。\u003cbr\u003e那么高速度是怎样影响到事物本身的运作的，就像那个航天员的例子，速度是怎样使航天员的1年相当于地球的100年的。我们分解物质本身，飞行器本身和人类本身都是由无数分子构成，分子细分成原子而原子再细分可以分成基本粒子以及其他未知但我们可以肯定其是处于运动状态的东西，还有它们之间的作用力也同样存在，这样，我们可以认为在常规速度下，这个物质集合体是一种牢固和稳定的存在，即即使你在这种状态下可以改变其形态，比如把飞行器给拦腰劈成2半，甚至把它融化成一团金属，但你无法同时作用于这个物质集合的每个原子上来使这个集合的原子同时发生状态的改变，即使其是运动状态的改变。但速度可以，\u003c/p\u003e\u003cp\u003e当这个集合接近于光速的时候，粒子与粒子间的作用力渐渐削弱，同样粒子的整体速度量在被新的速度量所左右，最后替代原来的速度量，最终表现出的是整个在此速度下的物质集合的运作状态都接近于停止，人类在其中表现就相当于在一个完美的冷冻箱中一样，所有的变化都因速度的提高而减慢了。在这一切发生的同时，外界并没有被影响，所以外界依然按照原本的速度来进行，这样的结果就是那个航天员回到地球发现时间过的飞快的原因所在。\u003cbr\u003e但是当速度接近光速的时候这种状态是及其脆弱的，所有在光速下运行的物质都不过是一团粒子流而已。\u003cbr\u003e速度能否超出光速。光速是速度的上限，因为光质状态下的物质无法再给其加速，不过有一个疑问和一个需要分析的现象。科幻片中一般都可以去未来或者过去旅行，那么通过接近光速可以让人的状态停止以达到到未来的话，那么去到过去是怎么一回事。有人认为当速度超出光速的时候，能够穿梭于第5维空间，即比传统的时间+3维空间的4维空间要高层次的空间，这个空间中保存着现在将来和过去，人类可以自由穿梭于所知的时间线上。当我们知道速度才是时间的时候其实这些想法已经没有其推论的根据了，因为假如要会到过去，那么可以认为过去的那一宇宙中所有的组成和目前宇宙的所有组成只是继承关系，即现在的状态由过去的状态运动而成，若要回到过去的状态，那么现在所有的已发生的事物运动按已有的轨迹反运动就可以返回到过去，并且还要保持自身的不运动。这是不可能的。所以超过光速来回到过去是不可行的。那么速度的顶点是不是光速？宇宙中有一种奇妙的星体，即黑洞，黑洞是说其组成部分的密度大到极限以至原子都被这样的密度所压碎。这样的状态产生的引力是及其恐怖的，“其引力已经大到光都无法逃出它的吸引”。更可能的说法是黑洞能引起空间的坍塌。那么如果是这样的话，是不是表示光速并不是速度的上限，因为有能克制光速的存在。其实不是这样的，为什么光逃不出黑洞，可以有2个解释：\u003cbr\u003e1是光速也不是万能的，因为存在不是万能的。没有谁规定说达到光速后宇宙到处都可以去，作为光速，光只是拥有光速的存在，只要是存在就必然会和其他存在互相影响，而黑洞的引力作用于光上的时候，因为光是一种物质，那么当其承受的引力上限不足以摆脱黑洞的时候，被黑洞吸引是必然的事情。\u003cbr\u003e2是黑洞作为一个在某点达到近乎无穷质量的存在的时候，空间是否还能承受如此庞大的点质量，那么在黑洞间，空间可能已经坍塌，中心甚至已经化作虚，前面说过虚就是宇宙大爆炸前宇宙外的状态。那么光射向黑洞的时候，光所经历的空间已经被打乱，不是光不想出来，而是光在其中即使跑多少年都出不来了，黑洞里完全就是一个没有终点的跑道，即使是光也跑不到终点，即使是跑到终点也不过化作虚而已。虚是没有终点的。\u003cbr\u003e那么狭义相对论……\u003cbr\u003e事实上以经不必再做下面的推理，因为目前的论证已经比较好的证明了时间这一存在到底是怎样的存在，接下来我会分析存在或某些规律的极限。\u003c/p\u003e\u003cp\u003e我的疑问是温度有没有上限。温度的下限是绝对0度，绝对0度下物质状态完全停止运行，这是科学界已经认定的事实。其实我有个很大的疑问，因为我总是认为事物是拥有正反2面并且正反是相对并能相成的。相成是指正反2面可以相成为一个事物。温度如果由0°开始向两方向来发展那么应该高到多少度就能低到多少度。事实上不是这样的，因为温度的上限可以非常大，但下限却非常小。为什么？考虑到是人为规定的温度标尺，所以要先验证标尺是否正确。绝对0°下的状态是物质运动状态被冻结的装态，0°却是水的固态和液态转换的时的温度，问题来了，因为2种状态的标尺不一致，即一种适用于任何物质而一种只是单一分子集合而已，所以0°的取点是不正确的，只不过是为了方便人类而人为划定的罢了。那么怎样来去温度的中点？要取温度的中点就要找到温度的上限，温度最高能到多少度？我在想象中，温度高到一定成度可以融化掉粒子间的结构甚至互相的作用力，那么再高呢，可能会直接把物质灼烧成能量，那么再高呢？那就是极其庞大的能量破开空间的后果。再高的话恐怕就是宇宙大爆炸的中心点的温度了。这样来说，温度的上限应该是有的，超过这样的上限，温度将变成另外的东西，但这个上限是多少，恐怕永远都无法测量，或许只有通过佐证来推理了。 \u003c/p\u003e\u003cp\u003e\u003c/p\u003e","editable_content":"","excerpt":"最近高中生说证明了哥德巴赫猜想，闹了个笑话，我想起了我十几年前也是高中的时候证明了时间是什么，贴出来博大家一笑。 \u003cb\u003e正文\u003c/b\u003e \u003cb\u003e时间以及其他(草)\u003c/b\u003e宏观的时间由微观的运动决定 2007年7月7日20:00:36 要以我自己的观点说明时间是什么，就要先建立一些我自己的体…","collapsed_by":"nobody","collapse_reason":"","annotation_action":[],"mark_infos":[],"relevant_info":{"is_relevant":false,"relevant_type":"","relevant_text":""},"suggest_edit":{"reason":"","status":false,"tip":"","title":"","unnormal_details":{"status":"","description":"","reason":"","reason_id":0,"note":""},"url":""},"is_labeled":false,"reward_info":{"can_open_reward":false,"is_rewardable":false,"reward_member_count":0,"reward_total_money":0,"tagline":""},"relationship":{"is_author":false,"is_authorized":false,"is_nothelp":false,"is_thanked":false,"voting":0,"upvoted_followees":[]}}],"paging":{"is_end":false,"is_start":false,"next":"https://www.zhihu.com/api/v4/questions/307595822/answers?include=data%5B%2A%5D.is_normal%2Cadmin_closed_comment%2Creward_info%2Cis_collapsed%2Cannotation_action%2Cannotation_detail%2Ccollapse_reason%2Cis_sticky%2Ccollapsed_by%2Csuggest_edit%2Ccomment_count%2Ccan_comment%2Ccontent%2Ceditable_content%2Cvoteup_count%2Creshipment_settings%2Ccomment_permission%2Ccreated_time%2Cupdated_time%2Creview_info%2Crelevant_info%2Cquestion%2Cexcerpt%2Crelationship.is_authorized%2Cis_author%2Cvoting%2Cis_thanked%2Cis_nothelp%2Cis_labeled%3Bdata%5B%2A%5D.mark_infos%5B%2A%5D.url%3Bdata%5B%2A%5D.author.follower_count%2Cbadge%5B%2A%5D.topics\u0026limit=1\u0026offset=238\u0026platform=desktop\u0026sort_by=default","previous":"https://www.zhihu.com/api/v4/questions/307595822/answers?include=data%5B%2A%5D.is_normal%2Cadmin_closed_comment%2Creward_info%2Cis_collapsed%2Cannotation_action%2Cannotation_detail%2Ccollapse_reason%2Cis_sticky%2Ccollapsed_by%2Csuggest_edit%2Ccomment_count%2Ccan_comment%2Ccontent%2Ceditable_content%2Cvoteup_count%2Creshipment_settings%2Ccomment_permission%2Ccreated_time%2Cupdated_time%2Creview_info%2Crelevant_info%2Cquestion%2Cexcerpt%2Crelationship.is_authorized%2Cis_author%2Cvoting%2Cis_thanked%2Cis_nothelp%2Cis_labeled%3Bdata%5B%2A%5D.mark_infos%5B%2A%5D.url%3Bdata%5B%2A%5D.author.follower_count%2Cbadge%5B%2A%5D.topics\u0026limit=1\u0026offset=236\u0026platform=desktop\u0026sort_by=default","totals":489}}
